Model: "model_7"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
iTracker_Network_Left_Eye_Image [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
iTracker_Network_Right_Eye_Imag [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
model_4 (Model)                 (None, 9216)         1559360     iTracker_Network_Right_Eye_Image_
                                                                 iTracker_Network_Left_Eye_Image_I
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 18432)        0           model_4[2][0]                    
                                                                 model_4[1][0]                    
__________________________________________________________________________________________________
iTracker_Network_Face_Eye_Image [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
iTracker_Network_Face_Grid_Inpu [(None, 625, 1)]     0                                            
__________________________________________________________________________________________________
fc-e1 (Dense)                   (None, 128)          2359424     concatenate_2[0][0]              
__________________________________________________________________________________________________
model_5 (Model)                 (None, 64)           2747392     iTracker_Network_Face_Eye_Image_I
__________________________________________________________________________________________________
model_6 (Model)                 (None, 128)          193152      iTracker_Network_Face_Grid_Input[
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 320)          0           fc-e1[0][0]                      
                                                                 model_5[1][0]                    
                                                                 model_6[1][0]                    
__________________________________________________________________________________________________
fc1 (Dense)                     (None, 128)          41088       concatenate_3[0][0]              
__________________________________________________________________________________________________
fc2 (Dense)                     (None, 2)            258         fc1[0][0]                        
==================================================================================================
Total params: 6,900,674
Trainable params: 6,900,674
Non-trainable params: 0
__________________________________________________________________________________________________
