Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Eye_Image_Network_Input (Inp [(None, 224, 224, 3)]     0         
_________________________________________________________________
conv-e1 (Conv2D)             (None, 54, 54, 96)        34944     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 26, 26, 96)        0         
_________________________________________________________________
cross_map_lr_n2d_4 (CrossMap (None, 26, 26, 96)        0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 30, 30, 96)        0         
_________________________________________________________________
conv-e2 (Conv2D)             (None, 26, 26, 256)       614656    
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 12, 12, 256)       0         
_________________________________________________________________
cross_map_lr_n2d_5 (CrossMap (None, 12, 12, 256)       0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 14, 14, 256)       0         
_________________________________________________________________
conv-e3 (Conv2D)             (None, 12, 12, 384)       885120    
_________________________________________________________________
conv-e4 (Conv2D)             (None, 12, 12, 64)        24640     
_________________________________________________________________
Eye_Image_Network_Output (Fl (None, 9216)              0         
=================================================================
Total params: 1,559,360
Trainable params: 1,559,360
Non-trainable params: 0
_________________________________________________________________
