Model: "model_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Face_Grid_Network_Input (Inp [(None, 625, 1)]          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 625)               0         
_________________________________________________________________
fc-fg1 (Dense)               (None, 256)               160256    
_________________________________________________________________
fc-fg2 (Dense)               (None, 128)               32896     
=================================================================
Total params: 193,152
Trainable params: 193,152
Non-trainable params: 0
_________________________________________________________________
