Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Face_Image_Network_Input (In [(None, 224, 224, 3)]     0         
_________________________________________________________________
conv-f1 (Conv2D)             (None, 54, 54, 96)        34944     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 26, 26, 96)        0         
_________________________________________________________________
cross_map_lr_n2d_6 (CrossMap (None, 26, 26, 96)        0         
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 30, 30, 96)        0         
_________________________________________________________________
conv-f2 (Conv2D)             (None, 26, 26, 256)       614656    
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 12, 12, 256)       0         
_________________________________________________________________
cross_map_lr_n2d_7 (CrossMap (None, 12, 12, 256)       0         
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 14, 14, 256)       0         
_________________________________________________________________
conv-f3 (Conv2D)             (None, 12, 12, 384)       885120    
_________________________________________________________________
conv-f4 (Conv2D)             (None, 12, 12, 64)        24640     
_________________________________________________________________
Face_Image_Network_Output (F (None, 9216)              0         
_________________________________________________________________
fc-e1 (Dense)                (None, 128)               1179776   
_________________________________________________________________
fc-e2 (Dense)                (None, 64)                8256      
=================================================================
Total params: 2,747,392
Trainable params: 2,747,392
Non-trainable params: 0
_________________________________________________________________
